SoCXin/AT32F413/src/SRC/CH561SFR.H
/* FIQ interrupt enable register */
#define R32_INT_EN_FIQ      (*((PUINT32V)0x0040004C)) // RW, FIQ interrupt enable
#define R8_INT_EN_FIQ_0     (*((PUINT8V)0x0040004C))  // RW, FIQ interrupt enable byte 0
#define  RB_IE_FIQ_TMR0     0x01                      // RW, FIQ interrupt enable for TMR0
#define  RB_IE_FIQ_TMR1     0x02                      // RW, FIQ interrupt enable for TMR1
#define  RB_IE_FIQ_TMR2     0x04                      // RW, FIQ interrupt enable for TMR2
#define  RB_IE_FIQ_TMR3     0x08                      // RW, FIQ interrupt enable for TMR3
#define  RB_IE_FIQ_SPI0     0x10                      // RW, FIQ interrupt enable for SPI0
#define  RB_IE_FIQ_SPI1     0x20                      // RW, FIQ interrupt enable for SPI1
#define  RB_IE_FIQ_UART0    0x40                      // RW, FIQ interrupt enable for UART0
#define  RB_IE_FIQ_UART1    0x80                      // RW, FIQ interrupt enable for UART1
#define R8_INT_EN_FIQ_1     (*((PUINT8V)0x0040004D))  // RW, FIQ interrupt enable byte 1
#define  RB_IE_FIQ_PA       0x01                      // RW, FIQ interrupt enable for GPIO PA
#define  RB_IE_FIQ_PB       0x02                      // RW, FIQ interrupt enable for GPIO PB

#define  RB_IE_FIQ_ADC      0x10                      // RW, FIQ interrupt enable for ADC
#define  RB_IE_FIQ_SLV      0x20                      // RW, FIQ interrupt enable for parallel slave

#define  RB_IE_FIQ_ETH      0x80                      // RW, FIQ interrupt enable for ethernet
#define R8_INT_EN_FIQ_GLOB  (*((PUINT8V)0x0040004F))  // RW, FIQ global interrupt enable
#define  RB_IE_FIQ_GLOB     0x80                      // RW, FIQ global interrupt enable

/* Interrupt enable register address offset and bit define */
#define BA_INT_FLAG         ((PUINT8V)0x00400040)     // point interrupt flag base address
#define BA_IE_IRQ           ((PUINT8V)0x00400048)     // point IRQ interrupt enable base address
#define BA_IE_FIQ           ((PUINT8V)0x0040004C)     // point FIQ interrupt enable base address
#define IE_BYTE_0           0
#define  RB_IE_TMR0         0x01                      // RW, interrupt enable for TMR0
#define  RB_IE_TMR1         0x02                      // RW, interrupt enable for TMR1
#define  RB_IE_TMR2         0x04                      // RW, interrupt enable for TMR2
#define  RB_IE_TMR3         0x08                      // RW, interrupt enable for TMR3
#define  RB_IE_SPI0         0x10                      // RW, interrupt enable for SPI0
#define  RB_IE_SPI1         0x20                      // RW, interrupt enable for SPI1
#define  RB_IE_UART0        0x40                      // RW, interrupt enable for UART0
#define  RB_IE_UART1        0x80                      // RW, interrupt enable for UART1
#define IE_BYTE_1           1
#define  RB_IE_PA           0x01                      // RW, interrupt enable for GPIO PA
#define  RB_IE_PB           0x02                      // RW, interrupt enable for GPIO PB

#define  RB_IE_ADC          0x10                      // RW, interrupt enable for ADC
#define  RB_IE_SLV          0x20                      // RW, interrupt enable for parallel slave

#define  RB_IE_ETH          0x80                      // RW, interrupt enable for ethernet
#define IE_BYTE_GLOB        3
#define  RB_IE_WOL          0x40                      // RW, IRQ interrupt enable for ethernet WOL, independent of global interrupt enable
#define  RB_IE_GLOB         0x80                      // RW, global interrupt enable

/* GPIO PA interrupt register */
#define R32_INT_STATUS_PA   (*((PUINT32V)0x00400050)) // RW1, GPIO PA interrupt flag
#define R8_INT_STATUS_PA_1  (*((PUINT8V)0x00400051))  // RW1, GPIO PA interrupt flag byte 1
#define R8_INT_STATUS_PA_2  (*((PUINT8V)0x00400052))  // RW1, GPIO PA interrupt flag byte 2
#define R32_INT_ENABLE_PA   (*((PUINT32V)0x00400054)) // RW, GPIO PA interrupt enable
#define R8_INT_ENABLE_PA_1  (*((PUINT8V)0x00400055))  // RW, GPIO PA interrupt enable byte 1
#define R8_INT_ENABLE_PA_2  (*((PUINT8V)0x00400056))  // RW, GPIO PA interrupt enable byte 2
#define R32_INT_MODE_PA     (*((PUINT32V)0x00400058)) // RW, GPIO PA interrupt mode: 0=level action, 1=edge action
#define R8_INT_MODE_PA_1    (*((PUINT8V)0x00400059))  // RW, GPIO PA interrupt mode byte 1
#define R8_INT_MODE_PA_2    (*((PUINT8V)0x0040005A))  // RW, GPIO PA interrupt mode byte 2
#define R32_INT_POLAR_PA    (*((PUINT32V)0x0040005C)) // RW, GPIO PA interrupt polarity: 0=normal/low level/fall edge, 1=invert/high level/rise edge
#define R8_INT_POLAR_PA_1   (*((PUINT8V)0x0040005D))  // RW, GPIO PA interrupt polarity byte 1
#define R8_INT_POLAR_PA_2   (*((PUINT8V)0x0040005E))  // RW, GPIO PA interrupt polarity byte 2

/* GPIO PB interrupt register */
#define R32_INT_STATUS_PB   (*((PUINT32V)0x00400060)) // RW1, GPIO PB interrupt flag
#define R8_INT_STATUS_PB_0  (*((PUINT8V)0x00400060))  // RW1, GPIO PB interrupt flag byte 0
#define R8_INT_STATUS_PB_1  (*((PUINT8V)0x00400061))  // RW1, GPIO PB interrupt flag byte 1
#define R8_INT_STATUS_PB_2  (*((PUINT8V)0x00400062))  // RW1, GPIO PB interrupt flag byte 2
#define R32_INT_ENABLE_PB   (*((PUINT32V)0x00400064)) // RW, GPIO PB interrupt enable
#define R8_INT_ENABLE_PB_0  (*((PUINT8V)0x00400064))  // RW, GPIO PB interrupt enable byte 0
#define R8_INT_ENABLE_PB_1  (*((PUINT8V)0x00400065))  // RW, GPIO PB interrupt enable byte 1
#define R8_INT_ENABLE_PB_2  (*((PUINT8V)0x00400066))  // RW, GPIO PB interrupt enable byte 2
#define R32_INT_MODE_PB     (*((PUINT32V)0x00400068)) // RW, GPIO PB interrupt mode: 0=level action, 1=edge action
#define R8_INT_MODE_PB_0    (*((PUINT8V)0x00400068))  // RW, GPIO PB interrupt mode byte 0
#define R8_INT_MODE_PB_1    (*((PUINT8V)0x00400069))  // RW, GPIO PB interrupt mode byte 1
#define R8_INT_MODE_PB_2    (*((PUINT8V)0x0040006A))  // RW, GPIO PB interrupt mode byte 2
#define R32_INT_POLAR_PB    (*((PUINT32V)0x0040006C)) // RW, GPIO PB interrupt polarity: 0=normal/low level/fall edge, 1=invert/high level/rise edge
#define R8_INT_POLAR_PB_0   (*((PUINT8V)0x0040006C))  // RW, GPIO PB interrupt polarity byte 0
#define R8_INT_POLAR_PB_1   (*((PUINT8V)0x0040006D))  // RW, GPIO PB interrupt polarity byte 1
#define R8_INT_POLAR_PB_2   (*((PUINT8V)0x0040006E))  // RW, GPIO PB interrupt polarity byte 2


/* GPIO interrupt register address offset and bit define */
#define BA_INT_PA           ((PUINT8V)0x00400050)     // point GPIO PA interrupt base address
#define BA_INT_PB           ((PUINT8V)0x00400060)     // point GPIO PB interrupt base address

#define INT_GPIO_STATUS     0x00
#define INT_GPIO_STATUS_0   0x00
#define INT_GPIO_STATUS_1   0x01
#define INT_GPIO_STATUS_2   0x02
#define INT_GPIO_ENABLE     0x04
#define INT_GPIO_ENABLE_0   0x04
#define INT_GPIO_ENABLE_1   0x05
#define INT_GPIO_ENABLE_2   0x06
#define INT_GPIO_MODE       0x08
#define INT_GPIO_MODE_0     0x08
#define INT_GPIO_MODE_1     0x09
#define INT_GPIO_MODE_2     0x0A
#define INT_GPIO_POLAR      0x0C
#define INT_GPIO_POLAR_0    0x0C
#define INT_GPIO_POLAR_1    0x0D
#define INT_GPIO_POLAR_2    0x0E

/* GPIO PA register */
#define R32_PA_DIR          (*((PUINT32V)0x00400080)) // RW, GPIO PA I/O direction: 0=in, 1=out
#define R8_PA_DIR_0         (*((PUINT8V)0x00400080))  // RW, GPIO PA I/O direction byte 0
#define R8_PA_DIR_1         (*((PUINT8V)0x00400081))  // RW, GPIO PA I/O direction byte 1
#define R8_PA_DIR_2         (*((PUINT8V)0x00400082))  // RW, GPIO PA I/O direction byte 2
#define R32_PA_PIN          (*((PUINT32V)0x00400084)) // RO, GPIO PA input
#define R8_PA_PIN_0         (*((PUINT8V)0x00400084))  // RO, GPIO PA input byte 0
#define R8_PA_PIN_1         (*((PUINT8V)0x00400085))  // RO, GPIO PA input byte 1
#define R8_PA_PIN_2         (*((PUINT8V)0x00400086))  // RO, GPIO PA input byte 2
#define R32_PA_OUT          (*((PUINT32V)0x00400088)) // RW, GPIO PA output
#define R8_PA_OUT_0         (*((PUINT8V)0x00400088))  // RW, GPIO PA output byte 0
#define R8_PA_OUT_1         (*((PUINT8V)0x00400089))  // RW, GPIO PA output byte 1
#define R8_PA_OUT_2         (*((PUINT8V)0x0040008A))  // RW, GPIO PA output byte 2
#define R32_PA_CLR          (*((PUINT32V)0x0040008C)) // WZ, GPIO PA clear output: 0=keep, 1=clear
#define R8_PA_CLR_0         (*((PUINT8V)0x0040008C))  // WZ, GPIO PA clear output byte 0
#define R8_PA_CLR_1         (*((PUINT8V)0x0040008D))  // WZ, GPIO PA clear output byte 1
#define R8_PA_CLR_2         (*((PUINT8V)0x0040008E))  // WZ, GPIO PA clear output byte 2
#define R32_PA_PU           (*((PUINT32V)0x00400090)) // RW, GPIO PA pullup resistance enable
#define R8_PA_PU_0          (*((PUINT8V)0x00400090))  // RW, GPIO PA pullup resistance enable byte 0
#define R8_PA_PU_1          (*((PUINT8V)0x00400091))  // RW, GPIO PA pullup resistance enable byte 1
#define R8_PA_PU_2          (*((PUINT8V)0x00400092))  // RW, GPIO PA pullup resistance enable byte 2
#define R32_PA_PD           (*((PUINT32V)0x00400094)) // RW, GPIO PA output open-drain & input pulldown resistance enable
#define R8_PA_PD_0          (*((PUINT8V)0x00400094))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 0
#define R8_PA_PD_1          (*((PUINT8V)0x00400095))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 1
#define R8_PA_PD_2          (*((PUINT8V)0x00400096))  // RW, GPIO PA output open-drain & input pulldown resistance enable byte 2
#define R32_PA_DRV          (*((PUINT32V)0x00400098)) // RW, GPIO PA driving capability: 0=4mA, 1=16mA
#define R8_PA_DRV_1         (*((PUINT8V)0x00400099))  // RW, GPIO PA driving capability byte 1
#define R8_PA_DRV_2         (*((PUINT8V)0x0040009A))  // RW, GPIO PA driving capability byte 2
#define R32_PA_SMT          (*((PUINT32V)0x0040009C)) // RW, GPIO PA output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PA_SMT_1         (*((PUINT8V)0x0040009D))  // RW, GPIO PA output slew rate & input schmitt trigger byte 1
#define R8_PA_SMT_2         (*((PUINT8V)0x0040009E))  // RW, GPIO PA output slew rate & input schmitt trigger byte 2

/* GPIO PB register */
#define R32_PB_DIR          (*((PUINT32V)0x004000A0)) // RW, GPIO PB I/O direction: 0=in, 1=out
#define R8_PB_DIR_0         (*((PUINT8V)0x004000A0))  // RW, GPIO PB I/O direction byte 0
#define R8_PB_DIR_1         (*((PUINT8V)0x004000A1))  // RW, GPIO PB I/O direction byte 1
#define R8_PB_DIR_2         (*((PUINT8V)0x004000A2))  // RW, GPIO PB I/O direction byte 2
#define R32_PB_PIN          (*((PUINT32V)0x004000A4)) // RO, GPIO PB input
#define R8_PB_PIN_0         (*((PUINT8V)0x004000A4))  // RO, GPIO PB input byte 0
#define R8_PB_PIN_1         (*((PUINT8V)0x004000A5))  // RO, GPIO PB input byte 1
#define R8_PB_PIN_2         (*((PUINT8V)0x004000A6))  // RO, GPIO PB input byte 2
#define R32_PB_OUT          (*((PUINT32V)0x004000A8)) // RW, GPIO PB output
#define R8_PB_OUT_0         (*((PUINT8V)0x004000A8))  // RW, GPIO PB output byte 0
#define R8_PB_OUT_1         (*((PUINT8V)0x004000A9))  // RW, GPIO PB output byte 1
#define R8_PB_OUT_2         (*((PUINT8V)0x004000AA))  // RW, GPIO PB output byte 2
#define R32_PB_CLR          (*((PUINT32V)0x004000AC)) // WZ, GPIO PB clear output: 0=keep, 1=clear
#define R8_PB_CLR_0         (*((PUINT8V)0x004000AC))  // WZ, GPIO PB clear output byte 0
#define R8_PB_CLR_1         (*((PUINT8V)0x004000AD))  // WZ, GPIO PB clear output byte 1
#define R8_PB_CLR_2         (*((PUINT8V)0x004000AE))  // WZ, GPIO PB clear output byte 2
#define R32_PB_PU           (*((PUINT32V)0x004000B0)) // RW, GPIO PB pullup resistance enable
#define R8_PB_PU_0          (*((PUINT8V)0x004000B0))  // RW, GPIO PB pullup resistance enable byte 0
#define R8_PB_PU_1          (*((PUINT8V)0x004000B1))  // RW, GPIO PB pullup resistance enable byte 1
#define R8_PB_PU_2          (*((PUINT8V)0x004000B2))  // RW, GPIO PB pullup resistance enable byte 2
#define R32_PB_PD           (*((PUINT32V)0x004000B4)) // RW, GPIO PB output open-drain & input pulldown resistance enable
#define R8_PB_PD_0          (*((PUINT8V)0x004000B4))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 0
#define R8_PB_PD_1          (*((PUINT8V)0x004000B5))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 1
#define R8_PB_PD_2          (*((PUINT8V)0x004000B6))  // RW, GPIO PB output open-drain & input pulldown resistance enable byte 2
#define R32_PB_DRV          (*((PUINT32V)0x004000B8)) // RW, GPIO PB driving capability: 0=4mA, 1=16mA
#define R8_PB_DRV_1         (*((PUINT8V)0x004000B9))  // RW, GPIO PB driving capability byte 1
#define R32_PB_SMT          (*((PUINT32V)0x004000BC)) // RW, GPIO PB output slew rate & input schmitt trigger: 0=fast,normal, 1=slow,schmitt
#define R8_PB_SMT_0         (*((PUINT8V)0x004000BC))  // RW, GPIO PB output slew rate & input schmitt trigger byte 0
#define R8_PB_SMT_1         (*((PUINT8V)0x004000BD))  // RW, GPIO PB output slew rate & input schmitt trigger byte 1
#define R8_PB_SMT_2         (*((PUINT8V)0x004000BE))  // RW, GPIO PB output slew rate & input schmitt trigger byte 2


/* GPIO register address offset and bit define */
#define BA_PA               ((PUINT8V)0x00400080)     // point GPIO PA base address
#define BA_PB               ((PUINT8V)0x004000A0)     // point GPIO PB base address

#define GPIO_DIR            0x00
#define GPIO_DIR_0          0x00
#define GPIO_DIR_1          0x01
#define GPIO_DIR_2          0x02
#define GPIO_DIR_3          0x03
#define GPIO_PIN            0x04
#define GPIO_PIN_0          0x04
#define GPIO_PIN_1          0x05
#define GPIO_PIN_2          0x06
#define GPIO_PIN_3          0x07
#define GPIO_OUT            0x08
#define GPIO_OUT_0          0x08
#define GPIO_OUT_1          0x09
#define GPIO_OUT_2          0x0A
#define GPIO_OUT_3          0x0B
#define GPIO_CLR            0x0C
#define GPIO_CLR_0          0x0C
#define GPIO_CLR_1          0x0D
#define GPIO_CLR_2          0x0E
#define GPIO_CLR_3          0x0F
#define GPIO_PU             0x10
#define GPIO_PU_0           0x10
#define GPIO_PU_1           0x11
#define GPIO_PU_2           0x12
#define GPIO_PU_3           0x13
#define GPIO_PD             0x14
#define GPIO_PD_0           0x14
#define GPIO_PD_1           0x15
#define GPIO_PD_2           0x16
#define GPIO_PD_3           0x17
#define GPIO_DRV            0x18
#define GPIO_DRV_0          0x18
#define GPIO_DRV_1          0x19
#define GPIO_DRV_2          0x1A
#define GPIO_SMT            0x1C
#define GPIO_SMT_0          0x1C
#define GPIO_SMT_1          0x1D
#define GPIO_SMT_2          0x1E


/* GPIO alias name */
#define  TWP0               (1<<4)                    // PA4
#define  TWP1               (1<<5)                    // PA5
#define  TACK               (1<<6)                    // PA6
#define  TDO                (1<<7)                    // PA7
#define  TRST               (1<<9)                    // PA9
#define  TDI                (1<<13)                   // PA13
#define  TCK                (1<<14)                   // PA14
#define  TMS                (1<<15)                   // PA15
#define  UID                (1<<8)                    // PA8
#define  SLVI               (1<<9)                    // PA9
#define  SLVA               (1<<10)                   // PA10
#define  SLVCS              (1<<11)                   // PA11
#define  TNOW0              (1<<7)                    // PA7
#define  DTR0               (1<<7)                    // PA7
#define  RTS0               (1<<8)                    // PA8
#define  CTS0               (1<<12)                   // PA12
#define  DSR0               (1<<13)                   // PA13
#define  RI0                (1<<14)                   // PA14
#define  DCD0               (1<<15)                   // PA15
#define  CTS1               (1<<16)                   // PA16
#define  RTS1               (1<<17)                   // PA17
#define  TNOW1              (1<<17)                   // PA17
#define  ELED               (1<<13)                   // PA13
#define  ELINK              (1<<18)                   // PA18
#define  VBUS               (1<<19)                   // PA19
#define  PRD                (1<<20)                   // PA20
#define  PWR                (1<<21)                   // PA21
#define  CTS0X              (1<<0)                    // PB0
#define  DSR0X              (1<<1)                    // PB1
#define  RI0X               (1<<2)                    // PB2
#define  DCD0X              (1<<3)                    // PB3
#define  DTR0X              (1<<4)                    // PB4
#define  RTS0X              (1<<5)                    // PB5
#define  TRAN0              (1<<0)                    // PB0
#define  RECV0              (1<<1)                    // PB1
#define  TRAN1              (1<<2)                    // PB2
#define  RECV1              (1<<3)                    // PB3
#define  PWM0               (1<<0)                    // PB0
#define  CAT0               (1<<1)                    // PB1
/* note: PB1/CAT0 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=1 */
#define  PWM1               (1<<2)                    // PB2
#define  CAT1               (1<<3)                    // PB3
#define  PWM2               (1<<4)                    // PB4
#define  CAT2               (1<<5)                    // PB5
#define  PWM3               (1<<6)                    // PB6
#define  CAT3               (1<<6)                    // PB6
#define  RXD0               (1<<8)                    // PB8
#define  TXD0               (1<<9)                    // PB9
#define  RXD1               (1<<10)                   // PB10
/* note: PB10/RXD1 will input from PECL if RB_MISC_PECL_EN=1 and TMR0.RB_TMR_OUT_EN=0 */
#define  RXTX1              (1<<10)                   // PB10
#define  TXD1               (1<<11)                   // PB11
#define  SCS                (1<<12)                   // PB12
#define  SCK0               (1<<13)                   // PB13
#define  MOSI               (1<<14)                   // PB14
#define  MISO               (1<<15)                   // PB15
#define  SDX0               (1<<15)                   // PB15
#define  ADCS               (1<<16)                   // PB16
#define  SCK1               (1<<17)                   // PB17
#define  SDO                (1<<18)                   // PB18
#define  SDI                (1<<19)                   // PB19
#define  SDX1               (1<<19)                   // PB19

