SoCXin/AT32F413/src/SRC/CH561SFR.H
/* Timer1 register */
#define R32_TMR1_CONTROL    (*((PUINT32V)0x00408400)) // RW, TMR1 control
#define R8_TMR1_CTRL_MOD    (*((PUINT8V)0x00408400))  // RW, TMR1 mode control
#define R8_TMR1_CTRL_DMA    (*((PUINT8V)0x00408401))  // RW, TMR1 DMA control
#define R8_TMR1_INTER_EN    (*((PUINT8V)0x00408402))  // RW, TMR1 interrupt enable
#define R8_TMR1_NRZI_CK_DIV (*((PUINT8V)0x00408403))  // RW, TMR1 NRZI clock divisor, only low 4 bit, from 0 to 15
#define R32_TMR1_STATUS     (*((PUINT32V)0x00408404)) // RW, TMR1 status
#define R8_TMR1_NRZI_STATUS (*((PUINT8V)0x00408404))  // RO, TMR1 NRZI status
#define R8_TMR1_INT_FLAG    (*((PUINT8V)0x00408406))  // RW1, TMR1 interrupt flag
#define R8_TMR1_FIFO_COUNT  (*((PUINT8V)0x00408407))  // RO, TMR1 FIFO count status
#define R32_TMR1_COUNT      (*((PUINT32V)0x00408408)) // RO, TMR1 current count
#define R16_TMR1_COUNT      (*((PUINT16V)0x00408408)) // RO, TMR1 current count
#define R8_TMR1_COUNT       (*((PUINT8V)0x00408408))  // RO, TMR1 current count
#define R32_TMR1_CNT_END    (*((PUINT32V)0x0040840C)) // RW, TMR1 end count value, only low 28 bit
#define R32_TMR1_FIFO       (*((PUINT32V)0x00408410)) // RO/WO, TMR1 FIFO register, only low 28 bit
#define R16_TMR1_FIFO       (*((PUINT16V)0x00408410)) // RO/WO, TMR1 FIFO register
#define R8_TMR1_FIFO        (*((PUINT8V)0x00408410))  // RO/WO, TMR1 FIFO register
#define R16_TMR1_DMA_NOW    (*((PUINT16V)0x00408414)) // RW, TMR1 DMA current address
#define R16_TMR1_DMA_BEG    (*((PUINT16V)0x00408418)) // RW, TMR1 DMA begin address
#define R16_TMR1_DMA_END    (*((PUINT16V)0x0040841C)) // RW, TMR1 DMA end address

/* Timer2 register */
#define R32_TMR2_CONTROL    (*((PUINT32V)0x00408800)) // RW, TMR2 control
#define R8_TMR2_CTRL_MOD    (*((PUINT8V)0x00408800))  // RW, TMR2 mode control
#define R8_TMR2_CTRL_DMA    (*((PUINT8V)0x00408801))  // RW, TMR2 DMA control
#define R8_TMR2_INTER_EN    (*((PUINT8V)0x00408802))  // RW, TMR2 interrupt enable
#define R32_TMR2_STATUS     (*((PUINT32V)0x00408804)) // RW, TMR2 status
#define R8_TMR2_INT_FLAG    (*((PUINT8V)0x00408806))  // RW1, TMR2 interrupt flag
#define R8_TMR2_FIFO_COUNT  (*((PUINT8V)0x00408807))  // RO, TMR2 FIFO count status
#define R32_TMR2_COUNT      (*((PUINT32V)0x00408808)) // RO, TMR2 current count
#define R16_TMR2_COUNT      (*((PUINT16V)0x00408808)) // RO, TMR2 current count
#define R8_TMR2_COUNT       (*((PUINT8V)0x00408808))  // RO, TMR2 current count
#define R32_TMR2_CNT_END    (*((PUINT32V)0x0040880C)) // RW, TMR2 end count value, only low 28 bit
#define R32_TMR2_FIFO       (*((PUINT32V)0x00408810)) // RO/WO, TMR2 FIFO register, only low 28 bit
#define R16_TMR2_FIFO       (*((PUINT16V)0x00408810)) // RO/WO, TMR2 FIFO register
#define R8_TMR2_FIFO        (*((PUINT8V)0x00408810))  // RO/WO, TMR2 FIFO register
#define R16_TMR2_DMA_NOW    (*((PUINT16V)0x00408814)) // RW, TMR2 DMA current address
#define R16_TMR2_DMA_BEG    (*((PUINT16V)0x00408818)) // RW, TMR2 DMA begin address
#define R16_TMR2_DMA_END    (*((PUINT16V)0x0040881C)) // RW, TMR2 DMA end address

/* Timer3 register */
#define R32_TMR3_CONTROL    (*((PUINT32V)0x00408C00)) // RW, TMR3 control
#define R8_TMR3_CTRL_MOD    (*((PUINT8V)0x00408C00))  // RW, TMR3 mode control
#define R8_TMR3_INTER_EN    (*((PUINT8V)0x00408C02))  // RW, TMR3 interrupt enable
#define R32_TMR3_STATUS     (*((PUINT32V)0x00408C04)) // RW, TMR3 status
#define R8_TMR3_INT_FLAG    (*((PUINT8V)0x00408C06))  // RW1, TMR3 interrupt flag
#define R8_TMR3_FIFO_COUNT  (*((PUINT8V)0x00408C07))  // RO, TMR3 FIFO count status
#define R32_TMR3_COUNT      (*((PUINT32V)0x00408C08)) // RO, TMR3 current count
#define R16_TMR3_COUNT      (*((PUINT16V)0x00408C08)) // RO, TMR3 current count
#define R8_TMR3_COUNT       (*((PUINT8V)0x00408C08))  // RO, TMR3 current count
#define R32_TMR3_CNT_END    (*((PUINT32V)0x00408C0C)) // RW, TMR3 end count value, only low 28 bit
#define R32_TMR3_FIFO       (*((PUINT32V)0x00408C10)) // RO/WO, TMR3 FIFO register, only low 28 bit
#define R16_TMR3_FIFO       (*((PUINT16V)0x00408C10)) // RO/WO, TMR3 FIFO register
#define R8_TMR3_FIFO        (*((PUINT8V)0x00408C10))  // RO/WO, TMR3 FIFO register

/* Timer register address offset and bit define */
#define TMR_FIFO_SIZE       8                         // timer FIFO size (depth)
#define BA_TMR0             ((PUINT8V)0x00408000)     // point TMR0 base address
#define BA_TMR1             ((PUINT8V)0x00408400)     // point TMR1 base address
#define BA_TMR2             ((PUINT8V)0x00408800)     // point TMR2 base address
#define BA_TMR3             ((PUINT8V)0x00408C00)     // point TMR3 base address
#define TMR_CTRL_MOD        0
#define  RB_TMR_MODE_IN     0x01                      // RW, timer in mode: 0=timer/PWM/count/NRZI encode, 1=catcher/NRZI decode
#define  RB_TMR_ALL_CLEAR   0x02                      // RW, force clear timer FIFO and count
#define  RB_TMR_COUNT_EN    0x04                      // RW, timer count enable
#define  RB_TMR_OUT_EN      0x08                      // RW, timer output enable
#define  RB_TMR_OUT_POLAR   0x10                      // RW, timer PWM/NRZI encode output polarity: 0=high action, 1=low action
#define  RB_TMR_CAT_WIDTH   0x10                      // RW, timer catcher input pulse min width selection: 0=16*clock, 1=8*clock
#define  RB_TMR_MODE_NRZI   0x20                      // RW, TMR0/TMR1 NRZI mode: 0=timer/PWM/catcher, 1=NRZI encode/decode
#define  RB_TMR3_MODE_COUNT 0x20                      // RW, TMR3 count mode: 0=timer/PWM/catcher/NRZI, 1=count
#define  RB_TMR_PWM_REPEAT  0xC0                      // RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16
#define  RB_TMR_CATCH_EDGE  0xC0                      // RW, timer catcher edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise
#define  RB_TMR_NRZI_BALAN  0xC0                      // RW, timer NRZI balance mode: 00/11=no balance, 01=32bit, 10=48bit
#define TMR_CTRL_DMA        1
#define  RB_TMR_DMA_ENABLE  0x01                      // RW, timer DMA enable
#define  RB_TMR_DMA_BURST   0x02                      // RW, timer DMA burst enable
#define  RB_TMR_DMA_LOOP    0x04                      // RW, timer DMA address loop enable
#define TMR_INTER_EN        2
#define  RB_TMR_IE_CYC_END  0x01                      // RW, enable interrupt for timer catcher count timeout or PWM cycle end
#define  RB_TMR_IE_DATA_ACT 0x02                      // RW, enable interrupt for timer catcher input action or PWM trigger or NRZI recv packet end/tran packet end
#define  RB_TMR_IE_FIFO_HF  0x04                      // RW, enable interrupt for timer FIFO half
#define  RB_TMR_IE_DMA_END  0x08                      // RW, enable interrupt for timer DMA completion
#define  RB_TMR_IE_FIFO_OV  0x10                      // RW, enable interrupt for timer FIFO overflow
#define  RB_TMR_IE_DMA_ERR  0x20                      // RW, enable interrupt for timer DMA respond error
#define  RB_TMR_IE_NRZI_AUX 0x40                      // RW, enable interrupt for timer NRZI aux notice: NRZI recv error/tran start new data block
#define  RB_TMR3_FORCE_EN   0x80                      // RW, TMR3 force together timer0/1/2 count enable, independent of RB_TMR_COUNT_EN
#define TMR_NRZI_CK_DIV     3
#define TMR_NRZI_STATUS     4
#define  RB_TMR_RECV_FREE   0x01                      // RO, timer NRZI receiver free status, 0->1 then RB_TMR_IF_DATA_ACT for recv
#define  RB_TMR_RECV_ERR    0x02                      // RO, timer NRZI receiving error status, 0->1 then RB_TMR_IF_NRZI_AUX for recv
#define  RB_TMR_TRAN_END    0x10                      // RO, timer NRZI transmittal end status, 0->1 then RB_TMR_IF_DATA_ACT for tran
#define  RB_TMR_TRAN_DOE    0x20                      // RO, timer NRZI transmitter encode output enable status, 0->1 then RB_TMR_IF_NRZI_AUX for tran
#define TMR_INT_FLAG        6
#define  RB_TMR_IF_CYC_END  0x01                      // RW1, interrupt flag for timer catcher count timeout or PWM cycle end
#define  RB_TMR_IF_DATA_ACT 0x02                      // RW1, interrupt flag for timer catcher input action or PWM trigger or NRZI recv packet end/tran packet end
#define  RB_TMR_IF_FIFO_HF  0x04                      // RW1, interrupt flag for timer FIFO half
#define  RB_TMR_IF_DMA_END  0x08                      // RW1, interrupt flag for timer DMA completion
#define  RB_TMR_IF_FIFO_OV  0x10                      // RW1, interrupt flag for timer FIFO overflow
#define  RB_TMR_IF_DMA_ERR  0x20                      // RW1, interrupt flag for timer DMA respond error
#define  RB_TMR_IF_NRZI_AUX 0x40                      // RW1, interrupt flag for timer NRZI aux notice: NRZI recv error/tran start new data block
#define TMR_FIFO_COUNT      7
#define TMR_COUNT           0x08
#define TMR_CNT_END         0x0C
#define TMR_FIFO            0x10
#define TMR_DMA_NOW         0x14
#define TMR_DMA_BEG         0x18
#define TMR_DMA_END         0x1C

/* Address space define */
#define BA_CODE             ((PUINT32)0x00000000)     // point code base address
#define SZ_CODE             0x00100000                // code size
#define BA_SFR              ((PUINT32)0x00400000)     // point SFR base address
#define SZ_SFR              0x00010000                // SFR size
#ifdef	MEM_DATA
#if		MEM_DATA == 32
#define BA_RAM              ((PUINT32)0x00818000)     // point RAM base address
#define SZ_RAM              0x00008000                // RAM size
#endif
#if		MEM_DATA == 64
#define BA_RAM              ((PUINT32)0x00810000)     // point RAM base address
#define SZ_RAM              0x00010000                // RAM size
#endif
#if		MEM_DATA == 96
#define BA_RAM              ((PUINT32)0x00808000)     // point RAM base address
#define SZ_RAM              0x00018000                // RAM size
#endif
#endif
#ifdef	SZ_RAM
#else
#define BA_RAM              ((PUINT32)( ( R8_GLOB_MEM_CFG & RB_GLOB_MEM_CFG ) == 0x03 ? 0x00808000 : ( ( R8_GLOB_MEM_CFG & RB_GLOB_MEM_CFG ) == 0x02 ? 0x00818000 : 0x00810000 ) ))  // point RAM base address
#define SZ_RAM              ( ( R8_GLOB_MEM_CFG & RB_GLOB_MEM_CFG ) == 0x03 ? 0x00018000 : ( ( R8_GLOB_MEM_CFG & RB_GLOB_MEM_CFG ) == 0x02 ? 0x00008000 : 0x00010000 ) )             // RAM size
#endif
#define BA_XBUS             ((PUINT32)0x00C00000)     // point XBUS base address
#define SZ_XBUS             0x00100000                // XBUS size

#ifdef __cplusplus
}
#endif

#endif
